profiling/stage_3/status_wrk.txt
Running 30s test @ http://127.0.0.1:8080/v0/status
  4 threads and 1024 connections
  Thread calibration: mean lat.: 2.110ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.118ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.861ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.952ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.88ms    0.91ms  11.64ms   73.19%
    Req/Sec    26.19k     3.85k   49.56k    78.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.75ms
 75.000%    2.33ms
 90.000%    3.03ms
 99.000%    4.88ms
 99.900%    6.59ms
 99.990%    9.18ms
 99.999%   10.72ms
100.000%   11.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.040     0.000000            1         1.00
       0.860     0.100000       186401         1.11
       1.151     0.200000       372588         1.25
       1.368     0.300000       558459         1.43
       1.563     0.400000       744513         1.67
       1.754     0.500000       930030         2.00
       1.853     0.550000      1022844         2.22
       1.957     0.600000      1116250         2.50
       2.069     0.650000      1209441         2.86
       2.191     0.700000      1301729         3.33
       2.331     0.750000      1394642         4.00
       2.411     0.775000      1440832         4.44
       2.503     0.800000      1488098         5.00
       2.605     0.825000      1533905         5.71
       2.725     0.850000      1580819         6.67
       2.863     0.875000      1626919         8.00
       2.943     0.887500      1650290         8.89
       3.029     0.900000      1673175        10.00
       3.127     0.912500      1696524        11.43
       3.237     0.925000      1719705        13.33
       3.365     0.937500      1742985        16.00
       3.439     0.943750      1754717        17.78
       3.521     0.950000      1766247        20.00
       3.619     0.956250      1777873        22.86
       3.733     0.962500      1789508        26.67
       3.877     0.968750      1801078        32.00
       3.963     0.971875      1806807        35.56
       4.067     0.975000      1812636        40.00
       4.191     0.978125      1818483        45.71
       4.335     0.981250      1824293        53.33
       4.495     0.984375      1830069        64.00
       4.587     0.985938      1832937        71.11
       4.691     0.987500      1835924        80.00
       4.803     0.989062      1838762        91.43
       4.935     0.990625      1841687       106.67
       5.083     0.992188      1844607       128.00
       5.167     0.992969      1846016       142.22
       5.259     0.993750      1847482       160.00
       5.355     0.994531      1848921       182.86
       5.467     0.995313      1850364       213.33
       5.595     0.996094      1851817       256.00
       5.675     0.996484      1852546       284.44
       5.763     0.996875      1853283       320.00
       5.859     0.997266      1853999       365.71
       5.971     0.997656      1854714       426.67
       6.111     0.998047      1855442       512.00
       6.191     0.998242      1855798       568.89
       6.275     0.998437      1856159       640.00
       6.379     0.998633      1856534       731.43
       6.483     0.998828      1856888       853.33
       6.607     0.999023      1857254      1024.00
       6.675     0.999121      1857437      1137.78
       6.767     0.999219      1857613      1280.00
       6.875     0.999316      1857801      1462.86
       6.999     0.999414      1857974      1706.67
       7.127     0.999512      1858157      2048.00
       7.227     0.999561      1858249      2275.56
       7.311     0.999609      1858338      2560.00
       7.399     0.999658      1858428      2925.71
       7.527     0.999707      1858521      3413.33
       7.659     0.999756      1858611      4096.00
       7.795     0.999780      1858655      4551.11
       7.951     0.999805      1858701      5120.00
       8.111     0.999829      1858748      5851.43
       8.391     0.999854      1858793      6826.67
       8.743     0.999878      1858837      8192.00
       9.015     0.999890      1858859      9102.22
       9.231     0.999902      1858883     10240.00
       9.463     0.999915      1858906     11702.86
       9.687     0.999927      1858927     13653.33
       9.823     0.999939      1858950     16384.00
       9.887     0.999945      1858962     18204.44
       9.983     0.999951      1858974     20480.00
      10.135     0.999957      1858986     23405.71
      10.223     0.999963      1858995     27306.67
      10.399     0.999969      1859007     32768.00
      10.455     0.999973      1859013     36408.89
      10.487     0.999976      1859019     40960.00
      10.519     0.999979      1859025     46811.43
      10.567     0.999982      1859029     54613.33
      10.639     0.999985      1859035     65536.00
      10.663     0.999986      1859038     72817.78
      10.687     0.999988      1859041     81920.00
      10.719     0.999989      1859044     93622.86
      10.727     0.999991      1859046    109226.67
      10.759     0.999992      1859049    131072.00
      10.775     0.999993      1859051    145635.56
      10.783     0.999994      1859052    163840.00
      10.895     0.999995      1859054    187245.71
      10.935     0.999995      1859055    218453.33
      10.991     0.999996      1859056    262144.00
      11.047     0.999997      1859057    291271.11
      11.103     0.999997      1859058    327680.00
      11.143     0.999997      1859059    374491.43
      11.143     0.999998      1859059    436906.67
      11.207     0.999998      1859060    524288.00
      11.207     0.999998      1859060    582542.22
      11.239     0.999998      1859061    655360.00
      11.239     0.999999      1859061    748982.86
      11.239     0.999999      1859061    873813.33
      11.311     0.999999      1859062   1048576.00
      11.311     0.999999      1859062   1165084.44
      11.311     0.999999      1859062   1310720.00
      11.311     0.999999      1859062   1497965.71
      11.311     0.999999      1859062   1747626.67
      11.647     1.000000      1859063   2097152.00
      11.647     1.000000      1859063          inf
#[Mean    =        1.879, StdDeviation   =        0.915]
#[Max     =       11.640, Total count    =      1859063]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2875293 requests in 30.00s, 287.92MB read
  Socket errors: connect 7, read 0, write 0, timeout 98
Requests/sec:  95845.76
Transfer/sec:      9.60MB